
&НаКлиенте
Процедура ПолучитьСлучайныхПользователей(Команда)
	
	ПолучитьСлучайныхПользователейНаСервере();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСлучайныхПользователейНаСервере()

	МассивПользователей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Наименование КАК Пользователь,
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	НЕ Пользователи.ПометкаУдаления
	               |	И НЕ Пользователи.Недействителен
	               |	И Пользователи.Наименование <> """"
	               |	И НЕ Пользователи.Предопределенный
	               |	И Пользователи.Наименование <> ""<Не указан>""
	               |	И НЕ Пользователи.Служебный";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Пользователи.ЭтоПолноправныйПользователь(Выборка.Ссылка, Истина)
			И Пользователи.ВходВПрограммуРазрешен(Выборка.Ссылка) Тогда
			МассивПользователей.Добавить(Выборка.Пользователь);
		КонецЕсли;
	
	КонецЦикла;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(Число(Формат(ТекущаяДата(), "ДФ=ddMMyyyyhhmmss")));

	Количество = ТабличныйДокумент.ВысотаТаблицы;
	
	Для СчетчикСтрок = 2 По Количество Цикл
		СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, МассивПользователей.ВГраница());
		СлучайныйПользователь = МассивПользователей[СлучайноеЧисло];
		
		ТабличныйДокумент.Область(СчетчикСтрок, 7, СчетчикСтрок, 7).Текст = СлучайныйПользователь;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	
	ВыполнитьСозданиеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСозданиеНаСервере()

	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	СтруктураПараметров = ОбъектОбработка.ПолучитьСтруктуруПараметровПользователя();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	ОбъектОбработка.СоздатьПолизователяПоПараметрам(СтруктураПараметров);

КонецПроцедуры // ВыполнитьСозданиеНаСервере()

&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	ПреобразоватьТабличныйДокументВТаблицуЗначений();
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьТабличныйДокументВТаблицуЗначений()
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ПоследняяСтрока = ТабличныйДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабличныйДокумент.ШиринаТаблицы;
	
	ОбластьЯчеек = ТабличныйДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);
	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	
	СтруктуруПараметровПользователя = ОбъектОбработка.ПолучитьСтруктуруПараметровПользователя();
	
	Для Каждого ПараметрСтруктуры Из СтруктуруПараметровПользователя Цикл
		
		Если ТабЗначений.Колонки.Найти(ПараметрСтруктуры.Ключ) = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Некоректная структура колонок табличного документа");
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТабЗначений Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктуруПараметровПользователя, СтрокаТаблицы); 
		Попытка
			ОбъектОбработка.СоздатьПолизователяПоПараметрам(СтруктуруПараметровПользователя);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивМинимальноВерсии = Новый Массив;
	МассивМинимальноВерсии.Добавить(3);
	МассивМинимальноВерсии.Добавить(1);
	МассивМинимальноВерсии.Добавить(3);
	
	ТекстОшибки = "";
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") = Неопределено Тогда
		ТекстОшибки = "Отсутсвует БСП";
	Иначе
		Результат = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
		МассивВерсии = СтрРазделить(Результат, ".");
		Если Не (Число(МассивВерсии[0]) >= МассивМинимальноВерсии[0] 
			И Число(МассивВерсии[1]) >= МассивМинимальноВерсии[1] 
			И Число(МассивВерсии[2]) >= МассивМинимальноВерсии[2]) Тогда
			
			ТекстОшибки = "Текущая версия БСП не поддерживается";	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекстОшибки <> "" Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


