

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	ОписанияПередаваемыхФайлов = ПолучитьОписанияФайлов();
	ОписанияПереданныхФайлов = Ждать ПоместитьФайлыНаСерверАсинх(,, ОписанияПередаваемыхФайлов);
	ОбработатьФайлыСпискаБазНаСервере(ОписанияПереданныхФайлов);

КонецПроцедуры

&НаСервере
Процедура ОбработатьФайлыСпискаБазНаСервере(ОписанияПереданныхФайлов)
	
	МассивОписанийБаз = Новый Массив;
	Для Каждого ФайлСпискаБаз Из ОписанияПереданныхФайлов Цикл
		ПрочитатьФайлВСтруктуру(ФайлСпискаБаз, МассивОписанийБаз);	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлВСтруктуру(ФайлСпискаБаз, МассивОписанийБаз)
	
	

КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписанияФайлов()
	
	МассивОписанийФайлов = Новый Массив;
	ВременныйКаталог = КаталогВременныхФайлов();	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Если СтрНайти(Строка(СистемнаяИнформация.ТипПлатформы), "Windows") Тогда
		
		ВременныйКаталог = СтрЗаменить(ВременныйКаталог, "\Local\Temp\", "\Roaming\1C\1CEStart\");
	
	ИначеЕсли СтрНайти(Строка(СистемнаяИнформация.ТипПлатформы), "Linux")
				Или СтрНайти(Строка(СистемнаяИнформация.ТипПлатформы), "MacOS") Тогда
		
		ВременныйКаталог = "~/.1C/1cestart";
	КонецЕсли;
	
	ПутиКФайламБаз = НайтиФайлы(ВременныйКаталог, "*.v8i"); 
	
	Для Каждого ФайлБаз Из ПутиКФайламБаз Цикл
		МассивОписанийФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлБаз.ПолноеИмя));		
	КонецЦикла;
	
	Файлы_1cestart = НайтиФайлы(ВременныйКаталог, "1cestart.cfg"); 
	
	Если Не ЗначениеЗаполнено(Файлы_1cestart) Тогда
		Возврат МассивОписанийФайлов;
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(Файлы_1cestart[0], 
											КодировкаТекста.UTF8, 
											Символы.ПС, 
											Символы.ВК + Символы.ПС);
	
	СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
	Пока СтрокаТекста <> Неопределено Цикл
		Если СтрНайти(СтрокаТекста, "CommonInfoBases=") Тогда
			СтрокаТекста = СтрЗаменить(СтрокаТекста, "CommonInfoBases=", "");
			МассивОписанийФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(СтрокаТекста));
		КонецЕсли;
		
		СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат МассивОписанийФайлов;

КонецФункции
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



&НаСервере
Процедура ПрочитатьСоставБазИзФайла(Параметры)
	
КонецПроцедуры


#КонецОбласти
